app/controllers/trucks_controller.rb

SELECT "trucks".* FROM "trucks"
---
  def map
    @trucks = Truck.all

SELECT "trucks".* FROM "trucks" WHERE ("trucks"."id" = 3) LIMIT 1
---
  def show
    @truck = Truck.find(params[:id])